OpenYellow/src/InformationRegisters/СтатистикаРепозиториев/СтатистикаРепозиториев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаРепозиториев</name>
  <resources>
    <name>Звезды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подписчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Форки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрошлоеМесто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Репозиторий</name>
    <type>
      <types>CatalogRef.Репозитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

OpenYellow/src/InformationRegisters/Тренды/Тренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Тренды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Изменение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Репозиторий</name>
    <type>
      <types>CatalogRef.Репозитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

OpenYellow/src/Catalogs/Запросы/Запросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Запросы</name>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

OpenYellow/src/Catalogs/Репозитории/Репозитории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Репозитории</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Авторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоФорк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнееОбновление</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаNotion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архивирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаNotionПоследние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрхивированПоследние</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраницаNotionОбновленные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрхивированОбновленные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тэги</name>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

OpenYellow/src/Catalogs/Авторы/Авторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Авторы</name>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аватар</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

OpenYellow/src/CommonModules/МетодыGitHub/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьДанныеОРепозиториях(Знач Страница = 1, Знач Запрос = "") Экспорт
		
    ОпределитьЗапросГитхаб(Запрос);	
    
	Данные = Инструментарий.ПолучитьСписокРепозиториев(Страница, Запрос);
	
	Если Данные.Получить("items") <> Неопределено Тогда
		
		ВсегоРепозиториев 	= Данные["total_count"];
		
		Если Страница = 1 Тогда
			ОбъектЗапрос = Запрос.ПолучитьОбъект();
			ОбъектЗапрос.Количество = ВсегоРепозиториев;
			ОбъектЗапрос.Записать();
		КонецЕсли;
		
		Для Каждого Репозиторий Из Данные["items"] Цикл		
            //@skip-check query-in-loop
            ОбработатьЗаписьДанныхРепозитория(Репозиторий);			
		КонецЦикла;
				
		Если 30 * Страница < ВсегоРепозиториев Тогда
			ОбновитьДанныеОРепозиториях(Страница + 1, Запрос);
		Иначе	
			ОбъектЗапрос = Запрос.ПолучитьОбъект();
			ОбъектЗапрос.Использован = Истина;
			ОбъектЗапрос.Записать();		
			Возврат;    
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьЗаписьДанныхРепозитория(Знач Репозиторий)
    
    ТекущийРепозиторий = ВернутьРепозиторий(Репозиторий["id"]);
    
    ТекущийРепозиторий.ДатаСоздания = Инструментарий.ФорматДата(Репозиторий["created_at"]);
    
    Попытка
        ТекущийРепозиторий.ПоследнееОбновление = Инструментарий.ФорматДата(Репозиторий["pushed_at"]);
    Исключение
        ТекущийРепозиторий.ПоследнееОбновление = Инструментарий.ФорматДата(Репозиторий["updated_at"]);
    КонецПопытки;
        
    ТекущийРепозиторий.Наименование = Репозиторий["name"];
    ТекущийРепозиторий.URL          = Репозиторий["html_url"];
    ТекущийРепозиторий.Описание     = Репозиторий["description"];
    ТекущийРепозиторий.Язык			= Репозиторий["language"];
    ТекущийРепозиторий.Размер		= Репозиторий["size"];
    ТекущийРепозиторий.Лицензия     = ?(Репозиторий["license"] = Неопределено
    , "Нет"
    , Репозиторий["license"]["name"]);
    
    Если ТипЗнч(Репозиторий["topics"]) = Тип("Массив") Тогда
        
        ТекущийРепозиторий.Тэги.Очистить();
        
        Для Каждого Топик Из Репозиторий["topics"] Цикл
            НовыйТэг = ТекущийРепозиторий.Тэги.Добавить();
            НовыйТэг.Тэг = Топик;
        КонецЦикла;
        
    КонецЕсли;		
    
    //Автор
    
    ДанныеАвтора              = Репозиторий["owner"];
    ТекущийАвтор              = ВернутьАвтора(ДанныеАвтора["id"]);
    ТекущийАвтор.Наименование = ДанныеАвтора["login"];
    ТекущийАвтор.URL          = ДанныеАвтора["html_url"];
    ТекущийАвтор.Аватар       = ДанныеАвтора["avatar_url"];
    
    ТекущийАвтор.Записать();
    
    ТекущийРепозиторий.Автор = ТекущийАвтор.Ссылка;
    
    Если Не ЗначениеЗаполнено(ТекущийРепозиторий.Ссылка) Тогда
        МетодыТелеграм.ОпубликоватьНовыйРепозиторий(ТекущийРепозиторий);
    КонецЕсли;

    ТекущийРепозиторий.Записать();
    
    //Статистика
    
    МЗ = РегистрыСведений.СтатистикаРепозиториев.СоздатьМенеджерЗаписи();
    МЗ.Репозиторий  = ТекущийРепозиторий.Ссылка;
    МЗ.Прочитать();
    
    ЗаписатьТренды(МЗ.Звезды, Репозиторий["stargazers_count"], ТекущийРепозиторий.Ссылка);
    
    МЗ.Репозиторий  = ТекущийРепозиторий.Ссылка;
    МЗ.Период       = ТекущаяДатаСеанса();
    МЗ.Звезды       = Репозиторий["stargazers_count"];
    МЗ.Подписчики   = Репозиторий["watchers_count"];
    МЗ.Форки        = Репозиторий["forks"];
    
    МЗ.Записать(Истина);

КонецПроцедуры

Процедура ОпределитьЗапросГитхаб(Запрос)
    
    Если Не ЗначениеЗаполнено(Запрос) Тогда
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |	Запросы.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Запросы КАК Запросы
        |ГДЕ
        |	НЕ Запросы.Использован
        |	И НЕ Запросы.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |	Запросы.Код";
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Если ВыборкаДетальныеЗаписи.Следующий() Тогда
            Запрос = ВыборкаДетальныеЗаписи.Ссылка;
        Иначе
            
            ВсеЗапросы = Справочники.Запросы.Выбрать();
            
            Пока ВсеЗапросы.Следующий() Цикл
                
                ОбъектЗапрос = ВсеЗапросы.Ссылка.ПолучитьОбъект();
                ОбъектЗапрос.Использован = Ложь;
                ОбъектЗапрос.Записать();
                
            КонецЦикла;
            
            МетодыNotion.ЗагрузитьНаNotion();
            ОпределитьЗапросГитхаб(Запрос);
            
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьТренды(Знач ПрошлоеЗначение, Знач НовоеЗначение, Знач Репозиторий)
    
    Если Не ЗначениеЗаполнено(НовоеЗначение) Тогда
        Возврат;
    КонецЕсли;
    
    Если ПрошлоеЗначение < НовоеЗначение Тогда
        МЗ = РегистрыСведений.Тренды.СоздатьМенеджерЗаписи();
        МЗ.Репозиторий = Репозиторий;
        МЗ.Изменение   = НовоеЗначение - ПрошлоеЗначение;
        МЗ.Период      = ТекущаяДатаСеанса();
        МЗ.Записать(Истина);
    КонецЕсли;
    
КонецПроцедуры

Функция ВернутьРепозиторий(Знач Код)
	
	ТекущийРепозиторий = Справочники.Репозитории.НайтиПоКоду(Код);
	
	Если Не ЗначениеЗаполнено(ТекущийРепозиторий) Тогда
		
		ВозвращаемыйРепозиторий = Справочники.Репозитории.СоздатьЭлемент();
		ВозвращаемыйРепозиторий.Код = Код;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Репозитории.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.Репозитории КАК Репозитории";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ВозвращаемыйРепозиторий.Группа = Цел(ВыборкаДетальныеЗаписи.Количество / 500) + 1;
		Иначе
			ВозвращаемыйРепозиторий.Группа = 1;
		КонецЕсли;
        
	Иначе		
		ВозвращаемыйРепозиторий = ТекущийРепозиторий.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ВозвращаемыйРепозиторий;
	
КонецФункции

Функция ВернутьАвтора(Знач Код)
	
	ТекущийАвтор = Справочники.Авторы.НайтиПоКоду(Код);
	
	Если Не ЗначениеЗаполнено(ТекущийАвтор) Тогда
		
		ВозвращаемыйАвтор = Справочники.Авторы.СоздатьЭлемент();
		ВозвращаемыйАвтор.Код = Код;
		
	Иначе
		
		ВозвращаемыйАвтор = ТекущийАвтор.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ВозвращаемыйАвтор;
	
КонецФункции

#КонецОбласти
